[NoCoverage] StringLiteral
src/coverage/lcov-report/block-navigation.js:4:63
 /* eslint-disable */
 var jumpToCode = (function init() {
     // Classes of code we would like to highlight in the file view
-    var missingCoverageClasses = ['.cbranch-no', '.cstat-no', '.fstat-no'];
+    var missingCoverageClasses = ['.cbranch-no', '.cstat-no', ""];
 
     // Elements to highlight in the file listing view

[NoCoverage] StringLiteral
src/coverage/lcov-report/block-navigation.js:10:61
     var fileListingElements = ['td.pct.low'];
 
     // We don't want to select elements that are direct descendants of another match
-    var notSelector = ':not(' + missingCoverageClasses.join('):not(') + ') > '; // becomes `:not(a):not(b) > `
+    var notSelector = ':not(' + missingCoverageClasses.join("") + ') > '; // becomes `:not(a):not(b) > `
 
     // Selecter that finds elements on the page to which we can jump

[NoCoverage] StringLiteral
src/coverage/lcov-report/block-navigation.js:10:23
     var fileListingElements = ['td.pct.low'];
 
     // We don't want to select elements that are direct descendants of another match
-    var notSelector = ':not(' + missingCoverageClasses.join('):not(') + ') > '; // becomes `:not(a):not(b) > `
+    var notSelector = "" + missingCoverageClasses.join('):not(') + ') > '; // becomes `:not(a):not(b) > `
 
     // Selecter that finds elements on the page to which we can jump

[NoCoverage] ArithmeticOperator
src/coverage/lcov-report/block-navigation.js:14:9
 
     // Selecter that finds elements on the page to which we can jump
     var selector =
-        fileListingElements.join(', ') +
-        ', ' +
-        notSelector +
-        missingCoverageClasses.join(', ' + notSelector); // becomes `:not(a):not(b) > a, :not(a):not(b) > b`
+        fileListingElements.join(', ') + ', ' + notSelector - missingCoverageClasses.join(', ' + notSelector); // becomes `:not(a):not(b) > a, :not(a):not(b) > b`
 
     // The NodeList of matching elements

[NoCoverage] StringLiteral
src/coverage/lcov-report/block-navigation.js:15:9
     // Selecter that finds elements on the page to which we can jump
     var selector =
         fileListingElements.join(', ') +
-        ', ' +
+        "" +
         notSelector +
         missingCoverageClasses.join(', ' + notSelector); // becomes `:not(a):not(b) > a, :not(a):not(b) > b`

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:24:33
 
     var currentIndex;
 
-    function toggleClass(index) {
-        missingCoverageElements
-            .item(currentIndex)
-            .classList.remove('highlighted');
-        missingCoverageElements.item(index).classList.add('highlighted');
-    }
+    function toggleClass(index) {}
 
     function makeCurrent(index) {

[NoCoverage] StringLiteral
src/coverage/lcov-report/block-navigation.js:27:31
     function toggleClass(index) {
         missingCoverageElements
             .item(currentIndex)
-            .classList.remove('highlighted');
+            .classList.remove("");
         missingCoverageElements.item(index).classList.add('highlighted');
     }

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:31:33
         missingCoverageElements.item(index).classList.add('highlighted');
     }
 
-    function makeCurrent(index) {
-        toggleClass(index);
-        currentIndex = index;
-        missingCoverageElements.item(index).scrollIntoView({
-            behavior: 'smooth',
-            block: 'center',
-            inline: 'center'
-        });
-    }
+    function makeCurrent(index) {}
 
     function goToPrevious() {

[NoCoverage] ObjectLiteral
src/coverage/lcov-report/block-navigation.js:34:60
     function makeCurrent(index) {
         toggleClass(index);
         currentIndex = index;
-        missingCoverageElements.item(index).scrollIntoView({
-            behavior: 'smooth',
-            block: 'center',
-            inline: 'center'
-        });
+        missingCoverageElements.item(index).scrollIntoView({});
     }
 

[NoCoverage] StringLiteral
src/coverage/lcov-report/block-navigation.js:36:20
         currentIndex = index;
         missingCoverageElements.item(index).scrollIntoView({
             behavior: 'smooth',
-            block: 'center',
+            block: "",
             inline: 'center'
         });

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:41:29
         });
     }
 
-    function goToPrevious() {
-        var nextIndex = 0;
-        if (typeof currentIndex !== 'number' || currentIndex === 0) {
-            nextIndex = missingCoverageElements.length - 1;
-        } else if (missingCoverageElements.length > 1) {
-            nextIndex = currentIndex - 1;
-        }
-
-        makeCurrent(nextIndex);
-    }
+    function goToPrevious() {}
 
     function goToNext() {

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:43:69
 
     function goToPrevious() {
         var nextIndex = 0;
-        if (typeof currentIndex !== 'number' || currentIndex === 0) {
-            nextIndex = missingCoverageElements.length - 1;
-        } else if (missingCoverageElements.length > 1) {
+        if (typeof currentIndex !== 'number' || currentIndex === 0) {} else if (missingCoverageElements.length > 1) {
             nextIndex = currentIndex - 1;
         }

[NoCoverage] EqualityOperator
src/coverage/lcov-report/block-navigation.js:43:49
 
     function goToPrevious() {
         var nextIndex = 0;
-        if (typeof currentIndex !== 'number' || currentIndex === 0) {
+        if (typeof currentIndex !== 'number' || currentIndex !== 0) {
             nextIndex = missingCoverageElements.length - 1;
         } else if (missingCoverageElements.length > 1) {

[NoCoverage] ArithmeticOperator
src/coverage/lcov-report/block-navigation.js:44:25
     function goToPrevious() {
         var nextIndex = 0;
         if (typeof currentIndex !== 'number' || currentIndex === 0) {
-            nextIndex = missingCoverageElements.length - 1;
+            nextIndex = missingCoverageElements.length + 1;
         } else if (missingCoverageElements.length > 1) {
             nextIndex = currentIndex - 1;

[NoCoverage] EqualityOperator
src/coverage/lcov-report/block-navigation.js:45:20
         var nextIndex = 0;
         if (typeof currentIndex !== 'number' || currentIndex === 0) {
             nextIndex = missingCoverageElements.length - 1;
-        } else if (missingCoverageElements.length > 1) {
+        } else if (missingCoverageElements.length >= 1) {
             nextIndex = currentIndex - 1;
         }

[NoCoverage] EqualityOperator
src/coverage/lcov-report/block-navigation.js:45:20
         var nextIndex = 0;
         if (typeof currentIndex !== 'number' || currentIndex === 0) {
             nextIndex = missingCoverageElements.length - 1;
-        } else if (missingCoverageElements.length > 1) {
+        } else if (missingCoverageElements.length <= 1) {
             nextIndex = currentIndex - 1;
         }

[NoCoverage] ArithmeticOperator
src/coverage/lcov-report/block-navigation.js:46:25
         if (typeof currentIndex !== 'number' || currentIndex === 0) {
             nextIndex = missingCoverageElements.length - 1;
         } else if (missingCoverageElements.length > 1) {
-            nextIndex = currentIndex - 1;
+            nextIndex = currentIndex + 1;
         }
 

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:52:25
         makeCurrent(nextIndex);
     }
 
-    function goToNext() {
-        var nextIndex = 0;
-
-        if (
-            typeof currentIndex === 'number' &&
-            currentIndex < missingCoverageElements.length - 1
-        ) {
-            nextIndex = currentIndex + 1;
-        }
-
-        makeCurrent(nextIndex);
-    }
+    function goToNext() {}
 
     return function jump(event) {

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/block-navigation.js:56:13
         var nextIndex = 0;
 
         if (
-            typeof currentIndex === 'number' &&
-            currentIndex < missingCoverageElements.length - 1
+            false
         ) {
             nextIndex = currentIndex + 1;

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/block-navigation.js:56:13
         var nextIndex = 0;
 
         if (
-            typeof currentIndex === 'number' &&
-            currentIndex < missingCoverageElements.length - 1
+            true
         ) {
             nextIndex = currentIndex + 1;

[NoCoverage] EqualityOperator
src/coverage/lcov-report/block-navigation.js:57:13
 
         if (
             typeof currentIndex === 'number' &&
-            currentIndex < missingCoverageElements.length - 1
+            currentIndex >= missingCoverageElements.length - 1
         ) {
             nextIndex = currentIndex + 1;

[NoCoverage] EqualityOperator
src/coverage/lcov-report/block-navigation.js:57:13
 
         if (
             typeof currentIndex === 'number' &&
-            currentIndex < missingCoverageElements.length - 1
+            currentIndex <= missingCoverageElements.length - 1
         ) {
             nextIndex = currentIndex + 1;

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:58:11
         if (
             typeof currentIndex === 'number' &&
             currentIndex < missingCoverageElements.length - 1
-        ) {
-            nextIndex = currentIndex + 1;
-        }
+        ) {}
 
         makeCurrent(nextIndex);

[NoCoverage] ArithmeticOperator
src/coverage/lcov-report/block-navigation.js:59:25
             typeof currentIndex === 'number' &&
             currentIndex < missingCoverageElements.length - 1
         ) {
-            nextIndex = currentIndex + 1;
+            nextIndex = currentIndex - 1;
         }
 

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:65:33
         makeCurrent(nextIndex);
     }
 
-    return function jump(event) {
-        if (
-            document.getElementById('fileSearch') === document.activeElement &&
-            document.activeElement != null
-        ) {
-            // if we're currently focused on the search input, we don't want to navigate
-            return;
-        }
-
-        switch (event.which) {
-            case 78: // n
-            case 74: // j
-                goToNext();
-                break;
-            case 66: // b
-            case 75: // k
-            case 80: // p
-                goToPrevious();
-                break;
-        }
-    };
+    return function jump(event) {};
 })();
 window.addEventListener('keydown', jumpToCode);

[NoCoverage] EqualityOperator
src/coverage/lcov-report/block-navigation.js:67:13
 
     return function jump(event) {
         if (
-            document.getElementById('fileSearch') === document.activeElement &&
+            document.getElementById('fileSearch') !== document.activeElement &&
             document.activeElement != null
         ) {

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/block-navigation.js:67:13
 
     return function jump(event) {
         if (
-            document.getElementById('fileSearch') === document.activeElement &&
-            document.activeElement != null
+            true
         ) {
             // if we're currently focused on the search input, we don't want to navigate

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/block-navigation.js:68:13
     return function jump(event) {
         if (
             document.getElementById('fileSearch') === document.activeElement &&
-            document.activeElement != null
+            true
         ) {
             // if we're currently focused on the search input, we don't want to navigate

[NoCoverage] EqualityOperator
src/coverage/lcov-report/block-navigation.js:68:13
     return function jump(event) {
         if (
             document.getElementById('fileSearch') === document.activeElement &&
-            document.activeElement != null
+            document.activeElement == null
         ) {
             // if we're currently focused on the search input, we don't want to navigate

[NoCoverage] BlockStatement
src/coverage/lcov-report/block-navigation.js:69:11
         if (
             document.getElementById('fileSearch') === document.activeElement &&
             document.activeElement != null
-        ) {
-            // if we're currently focused on the search input, we don't want to navigate
-            return;
-        }
+        ) {}
 
         switch (event.which) {

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/block-navigation.js:76:13
 
         switch (event.which) {
             case 78: // n
-            case 74: // j
-                goToNext();
-                break;
+            // n
+case 74:
             case 66: // b
             case 75: // k

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/block-navigation.js:81:13
                 break;
             case 66: // b
             case 75: // k
-            case 80: // p
-                goToPrevious();
-                break;
+            // k
+case 80:
         }
     };
