[NoCoverage] BooleanLiteral
src/coverage/lcov-report/sorter.js:7:19
     var cols,
         currentSort = {
             index: 0,
-            desc: false
+            desc: true
         };
 

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:11:25
         };
 
     // returns the summary table element
-    function getTable() {
-        return document.querySelector('.coverage-summary');
-    }
+    function getTable() {}
     // returns the thead element of the summary table
     function getTableHeader() {

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:15:31
         return document.querySelector('.coverage-summary');
     }
     // returns the thead element of the summary table
-    function getTableHeader() {
-        return getTable().querySelector('thead tr');
-    }
+    function getTableHeader() {}
     // returns the tbody element of the summary table
     function getTableBody() {

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:19:29
         return getTable().querySelector('thead tr');
     }
     // returns the tbody element of the summary table
-    function getTableBody() {
-        return getTable().querySelector('tbody');
-    }
+    function getTableBody() {}
     // returns the th element for nth column
     function getNthColumn(n) {

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:20:41
     }
     // returns the tbody element of the summary table
     function getTableBody() {
-        return getTable().querySelector('tbody');
+        return getTable().querySelector("");
     }
     // returns the th element for nth column

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:23:30
         return getTable().querySelector('tbody');
     }
     // returns the th element for nth column
-    function getNthColumn(n) {
-        return getTableHeader().querySelectorAll('th')[n];
-    }
+    function getNthColumn(n) {}
 
     function onFilterInput() {

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:24:50
     }
     // returns the th element for nth column
     function getNthColumn(n) {
-        return getTableHeader().querySelectorAll('th')[n];
+        return getTableHeader().querySelectorAll("")[n];
     }
 

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:27:30
         return getTableHeader().querySelectorAll('th')[n];
     }
 
-    function onFilterInput() {
-        const searchValue = document.getElementById('fileSearch').value;
-        const rows = document.getElementsByTagName('tbody')[0].children;
-        for (let i = 0; i < rows.length; i++) {
-            const row = rows[i];
-            if (
-                row.textContent
-                    .toLowerCase()
-                    .includes(searchValue.toLowerCase())
-            ) {
-                row.style.display = '';
-            } else {
-                row.style.display = 'none';
-            }
-        }
-    }
+    function onFilterInput() {}
 
     // loads the search box

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:29:52
 
     function onFilterInput() {
         const searchValue = document.getElementById('fileSearch').value;
-        const rows = document.getElementsByTagName('tbody')[0].children;
+        const rows = document.getElementsByTagName("")[0].children;
         for (let i = 0; i < rows.length; i++) {
             const row = rows[i];

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:30:25
     function onFilterInput() {
         const searchValue = document.getElementById('fileSearch').value;
         const rows = document.getElementsByTagName('tbody')[0].children;
-        for (let i = 0; i < rows.length; i++) {
+        for (let i = 0; false; i++) {
             const row = rows[i];
             if (

[NoCoverage] UpdateOperator
src/coverage/lcov-report/sorter.js:30:42
     function onFilterInput() {
         const searchValue = document.getElementById('fileSearch').value;
         const rows = document.getElementsByTagName('tbody')[0].children;
-        for (let i = 0; i < rows.length; i++) {
+        for (let i = 0; i < rows.length; i--) {
             const row = rows[i];
             if (

[NoCoverage] MethodExpression
src/coverage/lcov-report/sorter.js:33:17
         for (let i = 0; i < rows.length; i++) {
             const row = rows[i];
             if (
-                row.textContent
-                    .toLowerCase()
+                row.textContent.toUpperCase()
                     .includes(searchValue.toLowerCase())
             ) {

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:33:17
         for (let i = 0; i < rows.length; i++) {
             const row = rows[i];
             if (
-                row.textContent
-                    .toLowerCase()
-                    .includes(searchValue.toLowerCase())
+                true
             ) {
                 row.style.display = '';

[NoCoverage] MethodExpression
src/coverage/lcov-report/sorter.js:35:31
             if (
                 row.textContent
                     .toLowerCase()
-                    .includes(searchValue.toLowerCase())
+                    .includes(searchValue.toUpperCase())
             ) {
                 row.style.display = '';

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:36:15
                 row.textContent
                     .toLowerCase()
                     .includes(searchValue.toLowerCase())
-            ) {
-                row.style.display = '';
-            } else {
+            ) {} else {
                 row.style.display = 'none';
             }

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:37:37
                     .toLowerCase()
                     .includes(searchValue.toLowerCase())
             ) {
-                row.style.display = '';
+                row.style.display = "Stryker was here!";
             } else {
                 row.style.display = 'none';

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:38:20
                     .includes(searchValue.toLowerCase())
             ) {
                 row.style.display = '';
-            } else {
-                row.style.display = 'none';
-            }
+            } else {}
         }
     }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:45:29
     }
 
     // loads the search box
-    function addSearchBox() {
-        var template = document.getElementById('filterTemplate');
-        var templateClone = template.content.cloneNode(true);
-        templateClone.getElementById('fileSearch').oninput = onFilterInput;
-        template.parentElement.appendChild(templateClone);
-    }
+    function addSearchBox() {}
 
     // loads all columns

[NoCoverage] BooleanLiteral
src/coverage/lcov-report/sorter.js:47:56
     // loads the search box
     function addSearchBox() {
         var template = document.getElementById('filterTemplate');
-        var templateClone = template.content.cloneNode(true);
+        var templateClone = template.content.cloneNode(false);
         templateClone.getElementById('fileSearch').oninput = onFilterInput;
         template.parentElement.appendChild(templateClone);

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:48:38
     function addSearchBox() {
         var template = document.getElementById('filterTemplate');
         var templateClone = template.content.cloneNode(true);
-        templateClone.getElementById('fileSearch').oninput = onFilterInput;
+        templateClone.getElementById("").oninput = onFilterInput;
         template.parentElement.appendChild(templateClone);
     }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:53:28
     }
 
     // loads all columns
-    function loadColumns() {
-        var colNodes = getTableHeader().querySelectorAll('th'),
-            colNode,
-            cols = [],
-            col,
-            i;
-
-        for (i = 0; i < colNodes.length; i += 1) {
-            colNode = colNodes[i];
-            col = {
-                key: colNode.getAttribute('data-col'),
-                sortable: !colNode.getAttribute('data-nosort'),
-                type: colNode.getAttribute('data-type') || 'string'
-            };
-            cols.push(col);
-            if (col.sortable) {
-                col.defaultDescSort = col.type === 'number';
-                colNode.innerHTML =
-                    colNode.innerHTML + '<span class="sorter"></span>';
-            }
-        }
-        return cols;
-    }
+    function loadColumns() {}
     // attaches a data attribute to every tr element with an object
     // of data values keyed by column name

[NoCoverage] AssignmentOperator
src/coverage/lcov-report/sorter.js:60:42
             col,
             i;
 
-        for (i = 0; i < colNodes.length; i += 1) {
+        for (i = 0; i < colNodes.length; i -= 1) {
             colNode = colNodes[i];
             col = {

[NoCoverage] EqualityOperator
src/coverage/lcov-report/sorter.js:60:21
             col,
             i;
 
-        for (i = 0; i < colNodes.length; i += 1) {
+        for (i = 0; i <= colNodes.length; i += 1) {
             colNode = colNodes[i];
             col = {

[NoCoverage] BooleanLiteral
src/coverage/lcov-report/sorter.js:64:27
             colNode = colNodes[i];
             col = {
                 key: colNode.getAttribute('data-col'),
-                sortable: !colNode.getAttribute('data-nosort'),
+                sortable: colNode.getAttribute('data-nosort'),
                 type: colNode.getAttribute('data-type') || 'string'
             };

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:64:49
             colNode = colNodes[i];
             col = {
                 key: colNode.getAttribute('data-col'),
-                sortable: !colNode.getAttribute('data-nosort'),
+                sortable: !colNode.getAttribute(""),
                 type: colNode.getAttribute('data-type') || 'string'
             };

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:65:23
             col = {
                 key: colNode.getAttribute('data-col'),
                 sortable: !colNode.getAttribute('data-nosort'),
-                type: colNode.getAttribute('data-type') || 'string'
+                type: false
             };
             cols.push(col);

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:65:23
             col = {
                 key: colNode.getAttribute('data-col'),
                 sortable: !colNode.getAttribute('data-nosort'),
-                type: colNode.getAttribute('data-type') || 'string'
+                type: true
             };
             cols.push(col);

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:68:17
                 type: colNode.getAttribute('data-type') || 'string'
             };
             cols.push(col);
-            if (col.sortable) {
+            if (true) {
                 col.defaultDescSort = col.type === 'number';
                 colNode.innerHTML =

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:68:31
                 type: colNode.getAttribute('data-type') || 'string'
             };
             cols.push(col);
-            if (col.sortable) {
-                col.defaultDescSort = col.type === 'number';
-                colNode.innerHTML =
-                    colNode.innerHTML + '<span class="sorter"></span>';
-            }
+            if (col.sortable) {}
         }
         return cols;

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:69:39
             };
             cols.push(col);
             if (col.sortable) {
-                col.defaultDescSort = col.type === 'number';
+                col.defaultDescSort = true;
                 colNode.innerHTML =
                     colNode.innerHTML + '<span class="sorter"></span>';

[NoCoverage] EqualityOperator
src/coverage/lcov-report/sorter.js:69:39
             };
             cols.push(col);
             if (col.sortable) {
-                col.defaultDescSort = col.type === 'number';
+                col.defaultDescSort = col.type !== 'number';
                 colNode.innerHTML =
                     colNode.innerHTML + '<span class="sorter"></span>';

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:78:36
     }
     // attaches a data attribute to every tr element with an object
     // of data values keyed by column name
-    function loadRowData(tableRow) {
-        var tableCols = tableRow.querySelectorAll('td'),
-            colNode,
-            col,
-            data = {},
-            i,
-            val;
-        for (i = 0; i < tableCols.length; i += 1) {
-            colNode = tableCols[i];
-            col = cols[i];
-            val = colNode.getAttribute('data-value');
-            if (col.type === 'number') {
-                val = Number(val);
-            }
-            data[col.key] = val;
-        }
-        return data;
-    }
+    function loadRowData(tableRow) {}
     // loads all row data
     function loadData() {

[NoCoverage] EqualityOperator
src/coverage/lcov-report/sorter.js:85:21
             data = {},
             i,
             val;
-        for (i = 0; i < tableCols.length; i += 1) {
+        for (i = 0; i <= tableCols.length; i += 1) {
             colNode = tableCols[i];
             col = cols[i];

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:85:21
             data = {},
             i,
             val;
-        for (i = 0; i < tableCols.length; i += 1) {
+        for (i = 0; false; i += 1) {
             colNode = tableCols[i];
             col = cols[i];

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:89:40
             colNode = tableCols[i];
             col = cols[i];
             val = colNode.getAttribute('data-value');
-            if (col.type === 'number') {
-                val = Number(val);
-            }
+            if (col.type === 'number') {}
             data[col.key] = val;
         }

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:89:17
             colNode = tableCols[i];
             col = cols[i];
             val = colNode.getAttribute('data-value');
-            if (col.type === 'number') {
+            if (true) {
                 val = Number(val);
             }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:97:25
         return data;
     }
     // loads all row data
-    function loadData() {
-        var rows = getTableBody().querySelectorAll('tr'),
-            i;
-
-        for (i = 0; i < rows.length; i += 1) {
-            rows[i].data = loadRowData(rows[i]);
-        }
-    }
+    function loadData() {}
     // sorts the table using the data for the ith column
     function sortByIndex(index, desc) {

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:101:46
         var rows = getTableBody().querySelectorAll('tr'),
             i;
 
-        for (i = 0; i < rows.length; i += 1) {
-            rows[i].data = loadRowData(rows[i]);
-        }
+        for (i = 0; i < rows.length; i += 1) {}
     }
     // sorts the table using the data for the ith column

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:101:21
         var rows = getTableBody().querySelectorAll('tr'),
             i;
 
-        for (i = 0; i < rows.length; i += 1) {
+        for (i = 0; false; i += 1) {
             rows[i].data = loadRowData(rows[i]);
         }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:108:37
     // sorts the table using the data for the ith column
     function sortByIndex(index, desc) {
         var key = cols[index].key,
-            sorter = function(a, b) {
-                a = a.data[key];
-                b = b.data[key];
-                return a < b ? -1 : a > b ? 1 : 0;
-            },
+            sorter = function(a, b) {},
             finalSorter = sorter,
             tableBody = document.querySelector('.coverage-summary tbody'),

[NoCoverage] EqualityOperator
src/coverage/lcov-report/sorter.js:111:24
             sorter = function(a, b) {
                 a = a.data[key];
                 b = b.data[key];
-                return a < b ? -1 : a > b ? 1 : 0;
+                return a <= b ? -1 : a > b ? 1 : 0;
             },
             finalSorter = sorter,

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:111:37
             sorter = function(a, b) {
                 a = a.data[key];
                 b = b.data[key];
-                return a < b ? -1 : a > b ? 1 : 0;
+                return a < b ? -1 : false ? 1 : 0;
             },
             finalSorter = sorter,

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:115:51
             },
             finalSorter = sorter,
             tableBody = document.querySelector('.coverage-summary tbody'),
-            rowNodes = tableBody.querySelectorAll('tr'),
+            rowNodes = tableBody.querySelectorAll(""),
             rows = [],
             i;

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:119:13
             rows = [],
             i;
 
-        if (desc) {
+        if (true) {
             finalSorter = function(a, b) {
                 return -1 * sorter(a, b);

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:119:19
             rows = [],
             i;
 
-        if (desc) {
-            finalSorter = function(a, b) {
-                return -1 * sorter(a, b);
-            };
-        }
+        if (desc) {}
 
         for (i = 0; i < rowNodes.length; i += 1) {

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:120:42
             i;
 
         if (desc) {
-            finalSorter = function(a, b) {
-                return -1 * sorter(a, b);
-            };
+            finalSorter = function(a, b) {};
         }
 

[NoCoverage] ArithmeticOperator
src/coverage/lcov-report/sorter.js:121:24
 
         if (desc) {
             finalSorter = function(a, b) {
-                return -1 * sorter(a, b);
+                return -1 / sorter(a, b);
             };
         }

[NoCoverage] UnaryOperator
src/coverage/lcov-report/sorter.js:121:24
 
         if (desc) {
             finalSorter = function(a, b) {
-                return -1 * sorter(a, b);
+                return +1 * sorter(a, b);
             };
         }

[NoCoverage] EqualityOperator
src/coverage/lcov-report/sorter.js:125:21
             };
         }
 
-        for (i = 0; i < rowNodes.length; i += 1) {
+        for (i = 0; i >= rowNodes.length; i += 1) {
             rows.push(rowNodes[i]);
             tableBody.removeChild(rowNodes[i]);

[NoCoverage] EqualityOperator
src/coverage/lcov-report/sorter.js:125:21
             };
         }
 
-        for (i = 0; i < rowNodes.length; i += 1) {
+        for (i = 0; i <= rowNodes.length; i += 1) {
             rows.push(rowNodes[i]);
             tableBody.removeChild(rowNodes[i]);

[NoCoverage] MethodExpression
src/coverage/lcov-report/sorter.js:130:9
             tableBody.removeChild(rowNodes[i]);
         }
 
-        rows.sort(finalSorter);
+        rows;
 
         for (i = 0; i < rows.length; i += 1) {

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:132:46
 
         rows.sort(finalSorter);
 
-        for (i = 0; i < rows.length; i += 1) {
-            tableBody.appendChild(rows[i]);
-        }
+        for (i = 0; i < rows.length; i += 1) {}
     }
     // removes sort indicators for current column being sorted

[NoCoverage] AssignmentOperator
src/coverage/lcov-report/sorter.js:132:38
 
         rows.sort(finalSorter);
 
-        for (i = 0; i < rows.length; i += 1) {
+        for (i = 0; i < rows.length; i -= 1) {
             tableBody.appendChild(rows[i]);
         }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:137:37
         }
     }
     // removes sort indicators for current column being sorted
-    function removeSortIndicators() {
-        var col = getNthColumn(currentSort.index),
-            cls = col.className;
-
-        cls = cls.replace(/ sorted$/, '').replace(/ sorted-desc$/, '');
-        col.className = cls;
-    }
+    function removeSortIndicators() {}
     // adds sort indicators for current column being sorted
     function addSortIndicators() {

[NoCoverage] Regex
src/coverage/lcov-report/sorter.js:141:27
         var col = getNthColumn(currentSort.index),
             cls = col.className;
 
-        cls = cls.replace(/ sorted$/, '').replace(/ sorted-desc$/, '');
+        cls = cls.replace(/ sorted/, '').replace(/ sorted-desc$/, '');
         col.className = cls;
     }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:145:34
         col.className = cls;
     }
     // adds sort indicators for current column being sorted
-    function addSortIndicators() {
-        getNthColumn(currentSort.index).className += currentSort.desc
-            ? ' sorted-desc'
-            : ' sorted';
-    }
+    function addSortIndicators() {}
     // adds event listeners for all sorter widgets
     function enableUI() {

[NoCoverage] AssignmentOperator
src/coverage/lcov-report/sorter.js:146:9
     }
     // adds sort indicators for current column being sorted
     function addSortIndicators() {
-        getNthColumn(currentSort.index).className += currentSort.desc
-            ? ' sorted-desc'
-            : ' sorted';
+        getNthColumn(currentSort.index).className -= currentSort.desc ? ' sorted-desc' : ' sorted';
     }
     // adds event listeners for all sorter widgets

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:148:15
     function addSortIndicators() {
         getNthColumn(currentSort.index).className += currentSort.desc
             ? ' sorted-desc'
-            : ' sorted';
+            : "";
     }
     // adds event listeners for all sorter widgets

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:154:47
     function enableUI() {
         var i,
             el,
-            ithSorter = function ithSorter(i) {
-                var col = cols[i];
-
-                return function() {
-                    var desc = col.defaultDescSort;
-
-                    if (currentSort.index === i) {
-                        desc = !currentSort.desc;
-                    }
-                    sortByIndex(i, desc);
-                    removeSortIndicators();
-                    currentSort.index = i;
-                    currentSort.desc = desc;
-                    addSortIndicators();
-                };
-            };
+            ithSorter = function ithSorter(i) {};
         for (i = 0; i < cols.length; i += 1) {
             if (cols[i].sortable) {

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:157:35
             ithSorter = function ithSorter(i) {
                 var col = cols[i];
 
-                return function() {
-                    var desc = col.defaultDescSort;
-
-                    if (currentSort.index === i) {
-                        desc = !currentSort.desc;
-                    }
-                    sortByIndex(i, desc);
-                    removeSortIndicators();
-                    currentSort.index = i;
-                    currentSort.desc = desc;
-                    addSortIndicators();
-                };
+                return function() {};
             };
         for (i = 0; i < cols.length; i += 1) {

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:160:25
                 return function() {
                     var desc = col.defaultDescSort;
 
-                    if (currentSort.index === i) {
+                    if (true) {
                         desc = !currentSort.desc;
                     }

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:160:25
                 return function() {
                     var desc = col.defaultDescSort;
 
-                    if (currentSort.index === i) {
+                    if (false) {
                         desc = !currentSort.desc;
                     }

[NoCoverage] BooleanLiteral
src/coverage/lcov-report/sorter.js:161:32
                     var desc = col.defaultDescSort;
 
                     if (currentSort.index === i) {
-                        desc = !currentSort.desc;
+                        desc = currentSort.desc;
                     }
                     sortByIndex(i, desc);

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:170:21
                     addSortIndicators();
                 };
             };
-        for (i = 0; i < cols.length; i += 1) {
+        for (i = 0; false; i += 1) {
             if (cols[i].sortable) {
                 // add the click event handler on the th so users

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:170:46
                     addSortIndicators();
                 };
             };
-        for (i = 0; i < cols.length; i += 1) {
-            if (cols[i].sortable) {
-                // add the click event handler on the th so users
-                // dont have to click on those tiny arrows
-                el = getNthColumn(i).querySelector('.sorter').parentElement;
-                if (el.addEventListener) {
-                    el.addEventListener('click', ithSorter(i));
-                } else {
-                    el.attachEvent('onclick', ithSorter(i));
-                }
-            }
-        }
+        for (i = 0; i < cols.length; i += 1) {}
     }
     // adds sorting functionality to the UI

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:171:35
                 };
             };
         for (i = 0; i < cols.length; i += 1) {
-            if (cols[i].sortable) {
-                // add the click event handler on the th so users
-                // dont have to click on those tiny arrows
-                el = getNthColumn(i).querySelector('.sorter').parentElement;
-                if (el.addEventListener) {
-                    el.addEventListener('click', ithSorter(i));
-                } else {
-                    el.attachEvent('onclick', ithSorter(i));
-                }
-            }
+            if (cols[i].sortable) {}
         }
     }

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:171:17
                 };
             };
         for (i = 0; i < cols.length; i += 1) {
-            if (cols[i].sortable) {
+            if (false) {
                 // add the click event handler on the th so users
                 // dont have to click on those tiny arrows

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:175:21
                 // add the click event handler on the th so users
                 // dont have to click on those tiny arrows
                 el = getNthColumn(i).querySelector('.sorter').parentElement;
-                if (el.addEventListener) {
+                if (true) {
                     el.addEventListener('click', ithSorter(i));
                 } else {

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:175:42
                 // add the click event handler on the th so users
                 // dont have to click on those tiny arrows
                 el = getNthColumn(i).querySelector('.sorter').parentElement;
-                if (el.addEventListener) {
-                    el.addEventListener('click', ithSorter(i));
-                } else {
+                if (el.addEventListener) {} else {
                     el.attachEvent('onclick', ithSorter(i));
                 }

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:176:41
                 // dont have to click on those tiny arrows
                 el = getNthColumn(i).querySelector('.sorter').parentElement;
                 if (el.addEventListener) {
-                    el.addEventListener('click', ithSorter(i));
+                    el.addEventListener("", ithSorter(i));
                 } else {
                     el.attachEvent('onclick', ithSorter(i));

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:177:24
                 el = getNthColumn(i).querySelector('.sorter').parentElement;
                 if (el.addEventListener) {
                     el.addEventListener('click', ithSorter(i));
-                } else {
-                    el.attachEvent('onclick', ithSorter(i));
-                }
+                } else {}
             }
         }

[NoCoverage] StringLiteral
src/coverage/lcov-report/sorter.js:178:36
                 if (el.addEventListener) {
                     el.addEventListener('click', ithSorter(i));
                 } else {
-                    el.attachEvent('onclick', ithSorter(i));
+                    el.attachEvent("", ithSorter(i));
                 }
             }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:184:23
         }
     }
     // adds sorting functionality to the UI
-    return function() {
-        if (!getTable()) {
-            return;
-        }
-        cols = loadColumns();
-        loadData();
-        addSearchBox();
-        addSortIndicators();
-        enableUI();
-    };
+    return function() {};
 })();
 

[NoCoverage] ConditionalExpression
src/coverage/lcov-report/sorter.js:185:13
     }
     // adds sorting functionality to the UI
     return function() {
-        if (!getTable()) {
+        if (true) {
             return;
         }

[NoCoverage] BlockStatement
src/coverage/lcov-report/sorter.js:185:26
     }
     // adds sorting functionality to the UI
     return function() {
-        if (!getTable()) {
-            return;
-        }
+        if (!getTable()) {}
         cols = loadColumns();
         loadData();
