[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if (faces >= 2) {
-            this._faces = faces;
-        } else {
-            this._faces = 6;
-        }
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller constructor The constructor of the Roller class should automatically assign six as the number of faces if the provided value is not a valid number for a die face count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:10:13
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces >= 2) {
+        if (true) {
             this._faces = faces;
         } else {
killedBy: Roller constructor The constructor of the Roller class should automatically assign six as the number of faces if the provided value is not a valid number for a die face count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: 0

[Killed] EqualityOperator
src/Roller.ts:10:13
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces >= 2) {
+        if (faces < 2) {
             this._faces = faces;
         } else {
killedBy: Roller constructor The constructor of the Roller class should automatically assign six as the number of faces if the provided value is not a valid number for a die face count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: 0

[Killed] BlockStatement
src/Roller.ts:12:16
     constructor(faces: number) {
         if (faces >= 2) {
             this._faces = faces;
-        } else {
-            this._faces = 6;
-        }
+        } else {}
         this._distribution = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
killedBy: Roller constructor The constructor of the Roller class should automatically assign six as the number of faces if the provided value is not a valid number for a die face count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:16:48
             this._faces = 6;
         }
         this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
+        for (let i = 1; i <= this._faces; i++) {}
     }
 
killedBy: Roller roll The distribution of possible face values should be adjusted to reflect the occurrence of the most recent roll.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:16:25
             this._faces = 6;
         }
         this._distribution = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i < this._faces; i++) {
             this._distribution.set(i, 0);
         }
killedBy: Roller distribution The distribution method should initialize a Map with all possible face values as keys and 0 as values
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: 3

[Killed] BlockStatement
src/Roller.ts:33:33
     //      of rolls for that face by 1
     private lastRoll: number = 0;
 
-    roll(value: number): number {
-        if (value < 1 || value > this._faces) {
-            return 0;
-        }
-        this.lastRoll = value;
-        const count = this._distribution.get(value);
-        if (count !== undefined) {
-            this._distribution.set(value, count + 1);
-        }
-        return value;
-    }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller roll The roll function should output 0 if the input value is not valid for the number of faces on the die
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:34:13
     private lastRoll: number = 0;
 
     roll(value: number): number {
-        if (value < 1 || value > this._faces) {
+        if (value >= 1 || value > this._faces) {
             return 0;
         }
killedBy: Roller roll This test case is checking whether the roll method of the Roller class returns the provided value when it is a valid input for the number of faces of the die being rolled
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/Roller.ts:34:26
     private lastRoll: number = 0;
 
     roll(value: number): number {
-        if (value < 1 || value > this._faces) {
+        if (value < 1 || false) {
             return 0;
         }
killedBy: Roller roll The roll function should output 0 if the input value is not valid for the number of faces on the die
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 5

[Killed] EqualityOperator
src/Roller.ts:39:13
         }
         this.lastRoll = value;
         const count = this._distribution.get(value);
-        if (count !== undefined) {
+        if (count === undefined) {
             this._distribution.set(value, count + 1);
         }
killedBy: Roller roll The distribution of possible face values should be adjusted to reflect the occurrence of the most recent roll.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/Roller.ts:39:34
         }
         this.lastRoll = value;
         const count = this._distribution.get(value);
-        if (count !== undefined) {
-            this._distribution.set(value, count + 1);
-        }
+        if (count !== undefined) {}
         return value;
     }
killedBy: Roller roll The distribution of possible face values should be adjusted to reflect the occurrence of the most recent roll.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/Roller.ts:40:43
         this.lastRoll = value;
         const count = this._distribution.get(value);
         if (count !== undefined) {
-            this._distribution.set(value, count + 1);
+            this._distribution.set(value, count - 1);
         }
         return value;
killedBy: Roller roll The distribution of possible face values should be adjusted to reflect the occurrence of the most recent roll.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/Roller.ts:47:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-        return this.lastRoll;
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each
killedBy: Roller roll This test case verifies that after rolling the die, the value of the roll should be stored as the most recent roll.
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/Roller.ts:56:41
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number> {
-        return new Map<number, number>(this._distribution);
-    }
+    distribution(): Map<number, number> {}
 }
killedBy: Roller roll The distribution of possible face values should be adjusted to reflect the occurrence of the most recent roll.
statusReason: TypeError: Cannot read properties of undefined (reading 'get')
